{
    "list": [
        {
            "title": "Software Engineer/Technical Consultant",
            "company": "Olympic33",
            "link": "https://www.olympic33.co.nz",
            "start": "Feb 2021",
            "finish": "Oct 2023",
            "responsibilities": [
                "Software engineer and technical support for the consultant team.",
                "Utilising Microsoft technologies (Azure, Power platform and .NET Core) to develop solutions for clients and internal business",
                "Extension development for Microsoft Dynamics 365 Business Central"
            ],
            "achievements": [
                "Earned a Microsoft Azure Developer Associate Certification",
                "Delivered technical solutions to clients for integration needs.",
                "Core developer of a application for capturing data from an invoice/order documents."
            ]
        },
        {
            "title": "Finance Casual",
            "company": "Watercare",
            "link": "https://www.watercare.co.nz/",
            "start": "Aug 2020",
            "finish": "Feb 2021",
            "responsibilities": [
                "Validate invoices from accounts payable and send invoices into their payment system.",
                "Setting up template models (using Regex) for their invoice scanning system to pick up values from invoices coming from their business partners."
            ],
            "achievements": [
                "Validated invoices from July and August period.",
                "Set up template models for over 2000 regular business partners from their payment system."
            ]
        },
        {
            "title": "Software Engineer",
            "company": "Olympic Software Ltd.",
            "link": "https://www.olympic33.co.nz",
            "start": "Sep 2015",
            "finish": "Jun 2020",
            "responsibilities": [
                "Develop web application solutions for both clients and in-house business.",
                "Work with teams to design solutions for the web applications.",
                "Specialized on front-end development (AngularJS, Angular6 - 9) but also work on back-end developments when needed (SQL, .NET Framework and .NET Core)"
            ],
            "achievements": [
                "Lead a development team for an online shopping site belonging to one of the biggest client in our company.",
                "Contributed in the UI development in almost all of the in-house web applications."            ]
        },
        {
            "title": "Website Developer",
            "company": "Times Media",
            "link": "https://www.times.co.nz/times-media/",
            "start": "Jun 2010",
            "finish": "Apr 2015",
            "responsibilities": [
                "Develop websites using software tools, including content management systems (CMS) such as Joomla! and Drupal.",
                "Manage data and the web server in order to keep the websites running.",
                "Apply Search Engine Optimisation (SEO) knowledge to increase the search rank of the websites."
            ],
            "achievements": [
                "Maintained and improved 4-5 content-heavy websites owned by the business.",
                "Winner of 2014 New Zealand Community Newspaper Award (NZCNA) - Overall best website."
            ]
        }
    ]
}
